; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-7-20)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	plane7 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city0)
	(fuel-level plane1 fl5)
	(at plane2 city2)
	(fuel-level plane2 fl3)
	(at plane3 city0)
	(fuel-level plane3 fl2)
	(at plane4 city4)
	(fuel-level plane4 fl1)
	(at plane5 city2)
	(fuel-level plane5 fl1)
	(at plane6 city2)
	(fuel-level plane6 fl2)
	(at plane7 city0)
	(fuel-level plane7 fl4)
	(at person1 city0)
	(at person2 city1)
	(at person3 city0)
	(at person4 city2)
	(at person5 city0)
	(at person6 city2)
	(at person7 city3)
	(at person8 city0)
	(at person9 city0)
	(at person10 city0)
	(at person11 city0)
	(at person12 city3)
	(at person13 city0)
	(at person14 city4)
	(at person15 city4)
	(at person16 city3)
	(at person17 city4)
	(at person18 city1)
	(at person19 city3)
	(at person20 city2)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane4 city4)
	(at plane6 city3)
	(at person1 city2)
	(at person2 city0)
	(at person3 city3)
	(at person4 city1)
	(at person5 city3)
	(at person6 city3)
	(at person7 city2)
	(at person8 city2)
	(at person9 city4)
	(at person10 city1)
	(at person11 city2)
	(at person12 city3)
	(at person13 city3)
	(at person14 city1)
	(at person15 city1)
	(at person16 city3)
	(at person17 city2)
	(at person18 city2)
	(at person19 city3)
	(at person20 city3)
	))

)

; plan
1. (board person13 plane7 city0)
   deleted: (at person13 city0)
   added: (in person13 plane7)
   goals met: 4 of 22
2. (zoom plane7 city0 city3 fl4 fl3 fl2)
   deleted: (at plane7 city0) (fuel-level plane7 fl4)
   added: (at plane7 city3) (fuel-level plane7 fl2)
   goals met: 4 of 22
3. (board person7 plane7 city3)
   deleted: (at person7 city3)
   added: (in person7 plane7)
   goals met: 4 of 22
4. (debark person13 plane7 city3)
   deleted: (in person13 plane7)
   added: (at person13 city3)
   goals met: 5 of 22
5. (zoom plane7 city3 city2 fl2 fl1 fl0)
   deleted: (at plane7 city3) (fuel-level plane7 fl2)
   added: (at plane7 city2) (fuel-level plane7 fl0)
   goals met: 5 of 22
6. (debark person7 plane7 city2)
   deleted: (in person7 plane7)
   added: (at person7 city2)
   goals met: 6 of 22
7. (zoom plane6 city2 city3 fl2 fl1 fl0)
   deleted: (at plane6 city2) (fuel-level plane6 fl2)
   added: (at plane6 city3) (fuel-level plane6 fl0)
   goals met: 7 of 22
8. (board person17 plane4 city4)
   deleted: (at person17 city4)
   added: (in person17 plane4)
   goals met: 7 of 22
9. (board person15 plane4 city4)
   deleted: (at person15 city4)
   added: (in person15 plane4)
   goals met: 7 of 22
10. (board person14 plane4 city4)
   deleted: (at person14 city4)
   added: (in person14 plane4)
   goals met: 7 of 22
11. (board person11 plane3 city0)
   deleted: (at person11 city0)
   added: (in person11 plane3)
   goals met: 7 of 22
12. (zoom plane3 city0 city2 fl2 fl1 fl0)
   deleted: (at plane3 city0) (fuel-level plane3 fl2)
   added: (at plane3 city2) (fuel-level plane3 fl0)
   goals met: 7 of 22
13. (debark person11 plane3 city2)
   deleted: (in person11 plane3)
   added: (at person11 city2)
   goals met: 8 of 22
14. (board person6 plane2 city2)
   deleted: (at person6 city2)
   added: (in person6 plane2)
   goals met: 8 of 22
15. (zoom plane2 city2 city3 fl3 fl2 fl1)
   deleted: (at plane2 city2) (fuel-level plane2 fl3)
   added: (at plane2 city3) (fuel-level plane2 fl1)
   goals met: 8 of 22
16. (board person4 plane5 city2)
   deleted: (at person4 city2)
   added: (in person4 plane5)
   goals met: 8 of 22
17. (board person20 plane5 city2)
   deleted: (at person20 city2)
   added: (in person20 plane5)
   goals met: 8 of 22
18. (debark person6 plane2 city3)
   deleted: (in person6 plane2)
   added: (at person6 city3)
   goals met: 9 of 22
19. (board person9 plane1 city0)
   deleted: (at person9 city0)
   added: (in person9 plane1)
   goals met: 9 of 22
20. (board person8 plane1 city0)
   deleted: (at person8 city0)
   added: (in person8 plane1)
   goals met: 9 of 22
21. (board person5 plane1 city0)
   deleted: (at person5 city0)
   added: (in person5 plane1)
   goals met: 9 of 22
22. (board person3 plane1 city0)
   deleted: (at person3 city0)
   added: (in person3 plane1)
   goals met: 9 of 22
23. (board person10 plane1 city0)
   deleted: (at person10 city0)
   added: (in person10 plane1)
   goals met: 9 of 22
24. (zoom plane1 city0 city1 fl5 fl4 fl3)
   deleted: (at plane1 city0) (fuel-level plane1 fl5)
   added: (at plane1 city1) (fuel-level plane1 fl3)
   goals met: 9 of 22
25. (board person2 plane1 city1)
   deleted: (at person2 city1)
   added: (in person2 plane1)
   goals met: 9 of 22
26. (board person18 plane1 city1)
   deleted: (at person18 city1)
   added: (in person18 plane1)
   goals met: 9 of 22
27. (zoom plane1 city1 city0 fl3 fl2 fl1)
   deleted: (at plane1 city1) (fuel-level plane1 fl3)
   added: (at plane1 city0) (fuel-level plane1 fl1)
   goals met: 9 of 22
28. (debark person2 plane1 city0)
   deleted: (in person2 plane1)
   added: (at person2 city0)
   goals met: 10 of 22
29. (board person1 plane1 city0)
   deleted: (at person1 city0)
   added: (in person1 plane1)
   goals met: 10 of 22
30. (fly plane5 city2 city1 fl1 fl0)
   deleted: (at plane5 city2) (fuel-level plane5 fl1)
   added: (at plane5 city1) (fuel-level plane5 fl0)
   goals met: 10 of 22
31. (refuel plane5 city1 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 10 of 22
32. (debark person4 plane5 city1)
   deleted: (in person4 plane5)
   added: (at person4 city1)
   goals met: 11 of 22
33. (fly plane5 city1 city3 fl1 fl0)
   deleted: (at plane5 city1) (fuel-level plane5 fl1)
   added: (at plane5 city3) (fuel-level plane5 fl0)
   goals met: 11 of 22
34. (debark person20 plane5 city3)
   deleted: (in person20 plane5)
   added: (at person20 city3)
   goals met: 12 of 22
35. (fly plane4 city4 city1 fl1 fl0)
   deleted: (at plane4 city4) (fuel-level plane4 fl1)
   added: (at plane4 city1) (fuel-level plane4 fl0)
   goals met: 11 of 22
36. (refuel plane4 city1 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 11 of 22
37. (debark person15 plane4 city1)
   deleted: (in person15 plane4)
   added: (at person15 city1)
   goals met: 12 of 22
38. (debark person14 plane4 city1)
   deleted: (in person14 plane4)
   added: (at person14 city1)
   goals met: 13 of 22
39. (fly plane4 city1 city2 fl1 fl0)
   deleted: (at plane4 city1) (fuel-level plane4 fl1)
   added: (at plane4 city2) (fuel-level plane4 fl0)
   goals met: 13 of 22
40. (refuel plane4 city2 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 13 of 22
41. (debark person17 plane4 city2)
   deleted: (in person17 plane4)
   added: (at person17 city2)
   goals met: 14 of 22
42. (fly plane4 city2 city4 fl1 fl0)
   deleted: (at plane4 city2) (fuel-level plane4 fl1)
   added: (at plane4 city4) (fuel-level plane4 fl0)
   goals met: 15 of 22
43. (fly plane1 city0 city2 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl1)
   added: (at plane1 city2) (fuel-level plane1 fl0)
   goals met: 15 of 22
44. (refuel plane1 city2 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 15 of 22
45. (debark person8 plane1 city2)
   deleted: (in person8 plane1)
   added: (at person8 city2)
   goals met: 16 of 22
46. (debark person18 plane1 city2)
   deleted: (in person18 plane1)
   added: (at person18 city2)
   goals met: 17 of 22
47. (debark person1 plane1 city2)
   deleted: (in person1 plane1)
   added: (at person1 city2)
   goals met: 18 of 22
48. (fly plane1 city2 city3 fl1 fl0)
   deleted: (at plane1 city2) (fuel-level plane1 fl1)
   added: (at plane1 city3) (fuel-level plane1 fl0)
   goals met: 18 of 22
49. (refuel plane1 city3 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 18 of 22
50. (debark person5 plane1 city3)
   deleted: (in person5 plane1)
   added: (at person5 city3)
   goals met: 19 of 22
51. (debark person3 plane1 city3)
   deleted: (in person3 plane1)
   added: (at person3 city3)
   goals met: 20 of 22
52. (fly plane1 city3 city1 fl1 fl0)
   deleted: (at plane1 city3) (fuel-level plane1 fl1)
   added: (at plane1 city1) (fuel-level plane1 fl0)
   goals met: 20 of 22
53. (refuel plane1 city1 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 20 of 22
54. (debark person10 plane1 city1)
   deleted: (in person10 plane1)
   added: (at person10 city1)
   goals met: 21 of 22
55. (fly plane1 city1 city4 fl1 fl0)
   deleted: (at plane1 city1) (fuel-level plane1 fl1)
   added: (at plane1 city4) (fuel-level plane1 fl0)
   goals met: 21 of 22
56. (debark person9 plane1 city4)
   deleted: (in person9 plane1)
   added: (at person9 city4)
   goals met: 22 of 22
